JoeyWangTW/tokmagotchi/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM (SenseCAP Watcher ships 8MB PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Networking
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024

# BLE (NimBLE, smaller footprint than Bluedroid)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_MODE_BLE_ONLY=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# File systems
CONFIG_SPIFFS_OBJ_NAME_LEN=64

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Log level (debug during Phase 1)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# NVS encryption off for Phase 1 (add for Phase 2)
CONFIG_NVS_ENCRYPTION=n

# C++ exceptions — enable for cleaner error paths in pet state code
CONFIG_COMPILER_CXX_EXCEPTIONS=y
